HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_regdef.h
/** \\brief  CAN Fractional Divider Register */
typedef struct _Ifx_CAN_FDR_Bits
{
    unsigned int STEP:10;                   /**< \brief [9:0] Step Value (rw) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int DM:2;                      /**< \brief [15:14] Divider Mode (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CAN_FDR_Bits;

/** \\brief  Global Mark Register */
typedef struct _Ifx_CAN_GMR_Bits
{
    unsigned int reserved_0:9;              /**< \brief \internal Reserved */
    unsigned int GMFR:7;                    /**< \brief [15:9] Global Mark Fraction (rh) */
    unsigned int GM:16;                     /**< \brief [31:16] Global Mark (rh) */
} Ifx_CAN_GMR_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_CAN_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_CAN_ID_Bits;

/** \\brief  Kernel Reset Register 0 */
typedef struct _Ifx_CAN_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rw) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_CAN_KRST0_Bits;

/** \\brief  Kernel Reset Register 1 */
typedef struct _Ifx_CAN_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_CAN_KRST1_Bits;

/** \\brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_CAN_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_CAN_KRSTCLR_Bits;

/** \\brief  Last Global Mark Register */
typedef struct _Ifx_CAN_LGMR_Bits
{
    unsigned int reserved_0:9;              /**< \brief \internal Reserved */
    unsigned int LGMFR:7;                   /**< \brief [15:9] Last Global Mark Fraction (rh) */
    unsigned int LGM:16;                    /**< \brief [31:16] Last Global Mark (rh) */
} Ifx_CAN_LGMR_Bits;

/** \\brief  List Register */
typedef struct _Ifx_CAN_LIST_Bits
{
    unsigned int BEGIN:8;                   /**< \brief [7:0] List Begin (rh) */
    unsigned int END:8;                     /**< \brief [15:8] List End (rh) */
    unsigned int SIZE:8;                    /**< \brief [23:16] List Size (rh) */
    unsigned int EMPTY:1;                   /**< \brief [24:24] List Empty Indication (rh) */
    unsigned int reserved_25:7;             /**< \brief \internal Reserved */
} Ifx_CAN_LIST_Bits;

/** \\brief  Local Offset Register */
typedef struct _Ifx_CAN_LOR_Bits
{
    unsigned int NEWDISC:1;                 /**< \brief [0:0] New Discontinuity Bit (rh) */
    unsigned int DISC:1;                    /**< \brief [1:1] Discontinuity Bit (rh) */
    unsigned int reserved_2:7;              /**< \brief \internal Reserved */
    unsigned int LOFFR:7;                   /**< \brief [15:9] Local Offset Fraction (rwh) */
    unsigned int LOF:16;                    /**< \brief [31:16] Local Offset (rwh) */
} Ifx_CAN_LOR_Bits;

/** \\brief  Last Reference Mark Register */
typedef struct _Ifx_CAN_LREFMR_Bits
{
    unsigned int reserved_0:9;              /**< \brief \internal Reserved */
    unsigned int LREFMFR:7;                 /**< \brief [15:9] Last Reference Mark Fraction (rh) */
    unsigned int LREFM:16;                  /**< \brief [31:16] Last Reference Mark (rh) */
} Ifx_CAN_LREFMR_Bits;

/** \\brief  Local Time Capture Register */
typedef struct _Ifx_CAN_LTCR_Bits
{
    unsigned int reserved_0:6;              /**< \brief \internal Reserved */
    unsigned int LTFRC:10;                  /**< \brief [15:6] Local Time Fraction Value Capture (rh) */
    unsigned int LTC:16;                    /**< \brief [31:16] Local Time Value Capture (rh) */
} Ifx_CAN_LTCR_Bits;

/** \\brief  Local Time Register */
typedef struct _Ifx_CAN_LTR_Bits
{
    unsigned int reserved_0:6;              /**< \brief \internal Reserved */
    unsigned int LTFR:10;                   /**< \brief [15:6] Local Time Fraction (rh) */
    unsigned int LT:16;                     /**< \brief [31:16] Local Time (rh) */
} Ifx_CAN_LTR_Bits;

/** \\brief  Module Control Register */
typedef struct _Ifx_CAN_MCR_Bits
{
    unsigned int CLKSEL:4;                  /**< \brief [3:0] Baud Rate Logic Clock Select (rw) */
    unsigned int reserved_4:8;              /**< \brief \internal Reserved */
    unsigned int MPSEL:4;                   /**< \brief [15:12] Message Pending Selector (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CAN_MCR_Bits;

/** \\brief  Module Interrupt Trigger Register */
typedef struct _Ifx_CAN_MITR_Bits
{
    unsigned int IT:16;                     /**< \brief [15:0] Interrupt Trigger (w) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CAN_MITR_Bits;

/** \\brief  Message Object  Acceptance Mask Register */
typedef struct _Ifx_CAN_MO_AMR_Bits
{
    unsigned int AM:29;                     /**< \brief [28:0] Acceptance Mask for Message Identifier (rw) */
    unsigned int MIDE:1;                    /**< \brief [29:29] Acceptance Mask Bit for Message IDE Bit (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_CAN_MO_AMR_Bits;

/** \\brief  Message Object  Arbitration Register */
typedef struct _Ifx_CAN_MO_AR_Bits
{
    unsigned int ID:29;                     /**< \brief [28:0] CAN Identifier of Message Object n (rwh) */
    unsigned int IDE:1;                     /**< \brief [29:29] Identifier Extension Bit of Message Object n (rwh) */
    unsigned int PRI:2;                     /**< \brief [31:30] Priority Class (rw) */
} Ifx_CAN_MO_AR_Bits;

