HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_regdef.h
/** \\brief  OCDS Control and Status */
typedef struct _Ifx_CAN_OCS_Bits
{
    unsigned int TGS:2;                     /**< \brief [1:0] Trigger Set for OTGB0/1 (rw) */
    unsigned int TGB:1;                     /**< \brief [2:2] OTGB0/1 Bus Select (rw) */
    unsigned int TG_P:1;                    /**< \brief [3:3] TGS, TGB Write Protection (w) */
    unsigned int reserved_4:20;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_CAN_OCS_Bits;

/** \\brief  Panel Control Register */
typedef struct _Ifx_CAN_PANCTR_Bits
{
    unsigned int PANCMD:8;                  /**< \brief [7:0] Panel Command (rwh) */
    unsigned int BUSY:1;                    /**< \brief [8:8] Panel Busy Flag (rh) */
    unsigned int RBUSY:1;                   /**< \brief [9:9] Result Busy Flag (rh) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int PANAR1:8;                  /**< \brief [23:16] Panel Argument 1 (rwh) */
    unsigned int PANAR2:8;                  /**< \brief [31:24] Panel Argument 2 (rwh) */
} Ifx_CAN_PANCTR_Bits;

/** \\brief  Reference Mark Register */
typedef struct _Ifx_CAN_REFMR_Bits
{
    unsigned int reserved_0:9;              /**< \brief \internal Reserved */
    unsigned int REFMFR:7;                  /**< \brief [15:9] Reference Mark Fraction (rh) */
    unsigned int REFM:16;                   /**< \brief [31:16] Reference Mark (rh) */
} Ifx_CAN_REFMR_Bits;

/** \\brief  Scheduler Instruction Status Register */
typedef struct _Ifx_CAN_SISR_Bits
{
    unsigned int INP:4;                     /**< \brief [3:0] Interrupt Node Pointer (rh) */
    unsigned int IENTRAF0:1;                /**< \brief [4:4] Interrupt Enable if TRAF=0 (rh) */
    unsigned int IENTRAF1:1;                /**< \brief [5:5] Interrupt Enable if TRAF=1 (rh) */
    unsigned int IENRECF0:1;                /**< \brief [6:6] Interrupt Enable if RECF=0 (rh) */
    unsigned int IENRECF1:1;                /**< \brief [7:7] Interrupt Enable if RECF=1 (rh) */
    unsigned int CHEN:1;                    /**< \brief [8:8] Check Enable (rh) */
    unsigned int TREN:1;                    /**< \brief [9:9] Transmit Enable (rh) */
    unsigned int ALTMSG:2;                  /**< \brief [11:10] Alternative Message (rh) */
    unsigned int ARBM:2;                    /**< \brief [13:12] Arbitration Mode (rh) */
    unsigned int GM:1;                      /**< \brief [14:14] Gap Mode (rh) */
    unsigned int ICF:1;                     /**< \brief [15:15] Instruction Collection Finished (rh) */
    unsigned int RCEV:1;                    /**< \brief [16:16] Receive Control Entry Valid (rh) */
    unsigned int TCEV:1;                    /**< \brief [17:17] Transmit Control Entry Valid (rh) */
    unsigned int ICEV:1;                    /**< \brief [18:18] Interrupt Control Entry Valid (rh) */
    unsigned int ARBV:1;                    /**< \brief [19:19] Arbitration Entry Valid (rh) */
    unsigned int TMEV:1;                    /**< \brief [20:20] Time Mark Entry Valid (rh) */
    unsigned int RMEV:1;                    /**< \brief [21:21] Reference Mark Entry Valid (rh) */
    unsigned int BCEV:1;                    /**< \brief [22:22] Basic Cycle End Entry Valid (rh) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_CAN_SISR_Bits;

/** \\brief  Scheduler Start Pointer Node 0 Register */
typedef struct _Ifx_CAN_STPTR0_Bits
{
    unsigned int STPTR:7;                   /**< \brief [6:0] Start Pointer (rh) */
    unsigned int reserved_7:25;             /**< \brief \internal Reserved */
} Ifx_CAN_STPTR0_Bits;

/** \\brief  Scheduler Timing Status Register High */
typedef struct _Ifx_CAN_STSRH_Bits
{
    unsigned int TMETMV:16;                 /**< \brief [15:0] Time Mark Value from TME (rh) */
    unsigned int RCEMSGNR:8;                /**< \brief [23:16] Receive Control Entry Message Number (rh) */
    unsigned int TCEMSGNR:8;                /**< \brief [31:24] Transmit Control Entry Message Number (rh) */
} Ifx_CAN_STSRH_Bits;

/** \\brief  Scheduler Timing Status Register Low */
typedef struct _Ifx_CAN_STSRL_Bits
{
    unsigned int RMETMV:16;                 /**< \brief [15:0] Time Mark Value from RME (rh) */
    unsigned int BCETMV:16;                 /**< \brief [31:16] Time Mark Value from BCE (rh) */
} Ifx_CAN_STSRL_Bits;

/** \\brief  Synchronization Mark Register */
typedef struct _Ifx_CAN_SYNMR_Bits
{
    unsigned int reserved_0:9;              /**< \brief \internal Reserved */
    unsigned int SYNMFR:7;                  /**< \brief [15:9] Synchronization Mark Fraction (rh) */
    unsigned int SYNM:16;                   /**< \brief [31:16] Synchronization Mark (rh) */
} Ifx_CAN_SYNMR_Bits;

/** \\brief  Time Trigger Configuration Register */
typedef struct _Ifx_CAN_TTCFGR_Bits
{
    unsigned int IRO:7;                     /**< \brief [6:0] Initial Reference Offset (rw) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int EXPTT:8;                   /**< \brief [15:8] Expected Transmit Triggers (rw) */
    unsigned int RTO:8;                     /**< \brief [23:16] Reference Trigger Offset (rh) */
    unsigned int TTCNT:8;                   /**< \brief [31:24] Transmit Trigger Counter (rh) */
} Ifx_CAN_TTCFGR_Bits;

/** \\brief  Time Trigger Control Register */
typedef struct _Ifx_CAN_TTCR_Bits
{
    unsigned int TTM:2;                     /**< \brief [1:0] Time Trigger Mode (rw) */
    unsigned int ETESEL:2;                  /**< \brief [3:2] External Trigger Event Selection (rw) */
    unsigned int ETSSEL:3;                  /**< \brief [6:4] External Trigger Source Selection (rw) */
    unsigned int ETM:1;                     /**< \brief [7:7] External Trigger Mode (rw) */
    unsigned int TTLVL:1;                   /**< \brief [8:8] Time Trigger Level (rw) */
    unsigned int LTCTSS:3;                  /**< \brief [11:9] Local Time Capture Trigger Source Select (rw) */
    unsigned int TMPRIO:3;                  /**< \brief [14:12] Time Master Priority (rw) */
    unsigned int ETSSEX:1;                  /**< \brief [15:15] External Trigger Source Select Extension (rw) */
    unsigned int CYCLE:6;                   /**< \brief [21:16] Basic Cycle Number (rw) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int TENW:4;                    /**< \brief [27:24] Transmit Enable Window (rw) */
    unsigned int RMDLC:4;                   /**< \brief [31:28] Reference Message DLC (rw) */
} Ifx_CAN_TTCR_Bits;

/** \\brief  Time Trigger Flag Modification Register */
typedef struct _Ifx_CAN_TTFMR_Bits
{
    unsigned int CFGMEL:2;                  /**< \brief [1:0] Configuration Mode Enter/Leave (w) */
    unsigned int NIGSR:2;                   /**< \brief [3:2] Next Is Gap Flag Set/Reset (w) */
    unsigned int STE:1;                     /**< \brief [4:4] Software Trigger Event (w) */
    unsigned int ETREVR:1;                  /**< \brief [5:5] Reset External Trigger Event (w) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_CAN_TTFMR_Bits;

/** \\brief  Time Trigger Interrupt Enable Register */
typedef struct _Ifx_CAN_TTIER_Bits
{
    unsigned int NBCIE:2;                   /**< \brief [1:0] New Basic Cycle Interrupt Enable (rw) */
    unsigned int TENWERIE:1;                /**< \brief [2:2] Transmit Enable Window Error Interrupt Enable (rw) */
    unsigned int TTERIE:1;                  /**< \brief [3:3] Transmit Trigger Error Interrupt Enable (rw) */
    unsigned int reserved_4:2;              /**< \brief \internal Reserved */
    unsigned int WTEIE:1;                   /**< \brief [6:6] Watch Trigger Event Interrupt Enable (rw) */
    unsigned int AWDIE:1;                   /**< \brief [7:7] Application Watchdog Interrupt Enable (rw) */
    unsigned int ERRSCIE:1;                 /**< \brief [8:8] Error State Change Interrupt Enable (rw) */
    unsigned int MSRCIE:1;                  /**< \brief [9:9] Master Slave Relation Change Interrupt Enable (rw) */
    unsigned int SYNCSCIE:1;                /**< \brief [10:10] Synchronization State Change Interrupt Enable (rw) */
    unsigned int SEIE:1;                    /**< \brief [11:11] Scheduler Error Interrupt Enable (rw) */
    unsigned int NOTIFIE:1;                 /**< \brief [12:12] Notification Interrupt Enable (rw) */
    unsigned int reserved_13:19;            /**< \brief \internal Reserved */
} Ifx_CAN_TTIER_Bits;

/** \\brief  Time Trigger Interrupt Node Pointer Register */
typedef struct _Ifx_CAN_TTINPR_Bits
{
    unsigned int ERRINP:4;                  /**< \brief [3:0] Error Interrupt Node Pointer (rw) */
    unsigned int NBCINP:4;                  /**< \brief [7:4] New Basic Cycle Interrupt Node Pointer (rw) */
    unsigned int NOTIFINP:4;                /**< \brief [11:8] Notification Interrupt Node Pointer (rw) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_CAN_TTINPR_Bits;

