HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_regdef.h
/** \\brief  Time Trigger Interrupt Request Register */
typedef struct _Ifx_CAN_TTIRR_Bits
{
    unsigned int NMC:1;                     /**< \brief [0:0] New Matrix Cycle (rwh) */
    unsigned int NBC:1;                     /**< \brief [1:1] New Basic Cycle (rwh) */
    unsigned int TENWER:1;                  /**< \brief [2:2] Transmit Enable Window Error (rwh) */
    unsigned int TTUF:1;                    /**< \brief [3:3] Transmit Trigger Underflow (rwh) */
    unsigned int TTOF:1;                    /**< \brief [4:4] Transmit Trigger Overflow (rwh) */
    unsigned int WTE:1;                     /**< \brief [5:5] Watch Trigger EventThe WTE can be generated only after the first message has been transferred on the bus. (rwh) */
    unsigned int IWTE:1;                    /**< \brief [6:6] Init Watch Trigger EventThe IWTE can be generated only until the first message has been transferred on the bus. (rwh) */
    unsigned int AWDERR:1;                  /**< \brief [7:7] Application Watchdog Error (rwh) */
    unsigned int ERRSC:1;                   /**< \brief [8:8] Error State Change (rwh) */
    unsigned int MSRC:1;                    /**< \brief [9:9] Master-Slave Relation Change (rwh) */
    unsigned int SYNCSC:1;                  /**< \brief [10:10] Synchronization State Change (rwh) */
    unsigned int EOS:1;                     /**< \brief [11:11] End Of Scheduler Entry Flag (rwh) */
    unsigned int WFE:1;                     /**< \brief [12:12] Wait For Event Flag (rwh) */
    unsigned int DISC:1;                    /**< \brief [13:13] Discontinuity Flag (rwh) */
    unsigned int SERR1:1;                   /**< \brief [14:14] Scheduler Error 1 Flag (rwh) */
    unsigned int SERR2:1;                   /**< \brief [15:15] Scheduler Error 2 Flag (rwh) */
    unsigned int CFGERR:1;                  /**< \brief [16:16] Configuration Error (rwh) */
    unsigned int TURERR:1;                  /**< \brief [17:17] TUR Adjust Error (rwh) */
    unsigned int reserved_18:14;            /**< \brief \internal Reserved */
} Ifx_CAN_TTIRR_Bits;

/** \\brief  Time Trigger Status Register */
typedef struct _Ifx_CAN_TTSR_Bits
{
    unsigned int ERRS:2;                    /**< \brief [1:0] Error State (rh) */
    unsigned int MSR:2;                     /**< \brief [3:2] Master-Slave Relation (rh) */
    unsigned int SYNCS:2;                   /**< \brief [5:4] Synchronization State (rh) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int EFI:1;                     /**< \brief [8:8] Error Frame Indication (rh) */
    unsigned int EFF:1;                     /**< \brief [9:9] Error Frame Flag (rh) */
    unsigned int REFTRG:1;                  /**< \brief [10:10] Reference Trigger Flag (rh) */
    unsigned int ARB:1;                     /**< \brief [11:11] Arbitration Window Flag (rh) */
    unsigned int CFGM:1;                    /**< \brief [12:12] Configuration Mode Flag (rh) */
    unsigned int TMPC:1;                    /**< \brief [13:13] Time Master Priority Conflict (rh) */
    unsigned int TRAF:1;                    /**< \brief [14:14] Transmission Finished Flag (rh) */
    unsigned int RECF:1;                    /**< \brief [15:15] Reception Finished Flag (rh) */
    unsigned int MSCMIN:3;                  /**< \brief [18:16] Minimum of MSC Bit Fields (rh) */
    unsigned int reserved_19:1;             /**< \brief \internal Reserved */
    unsigned int MSCMAX:3;                  /**< \brief [22:20] Maximum of MSC Bit Fields (rh) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int NIG:1;                     /**< \brief [24:24] Next Is Gap (rh) */
    unsigned int ETR:1;                     /**< \brief [25:25] External Trigger Request (rh) */
    unsigned int ETREV:1;                   /**< \brief [26:26] External Trigger Event (rh) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_CAN_TTSR_Bits;

/** \\brief  Time Unit Ratio Register */
typedef struct _Ifx_CAN_TURR_Bits
{
    unsigned int ADJEN:1;                   /**< \brief [0:0] Adjust Enable (rwh) */
    unsigned int reserved_1:5;              /**< \brief \internal Reserved */
    unsigned int TURADJ:10;                 /**< \brief [15:6] Time Unit Ratio Adjust (rwh) */
    unsigned int VAL:1;                     /**< \brief [16:16] Valid (rh) */
    unsigned int LTCS:1;                    /**< \brief [17:17] Local Time Clock Source (rw) */
    unsigned int LTDIV:3;                   /**< \brief [20:18] Local Time Divider (rw) */
    unsigned int reserved_21:1;             /**< \brief \internal Reserved */
    unsigned int TUR:10;                    /**< \brief [31:22] TUR (rh) */
} Ifx_CAN_TURR_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Can_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_ACCEN0_Bits B;
} Ifx_CAN_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_ACCEN1_Bits B;
} Ifx_CAN_ACCEN1;

/** \\brief  Application Watchdog Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_AWDR_Bits B;
} Ifx_CAN_AWDR;

/** \\brief  CAN Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_CLC_Bits B;
} Ifx_CAN_CLC;

/** \\brief  Cycle Time Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_CYCTMR_Bits B;
} Ifx_CAN_CYCTMR;

