HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCan_regdef.h
/** \\brief  Node Bit Timing Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_N_BTR_Bits B;
} Ifx_CAN_N_BTR;

/** \\brief  Node Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_N_CR_Bits B;
} Ifx_CAN_N_CR;

/** \\brief  Node Error Counter Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_N_ECNT_Bits B;
} Ifx_CAN_N_ECNT;

/** \\brief  Node Frame Counter Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_N_FCR_Bits B;
} Ifx_CAN_N_FCR;

/** \\brief  Node Interrupt Pointer Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_N_IPR_Bits B;
} Ifx_CAN_N_IPR;

/** \\brief  Node Port Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_N_PCR_Bits B;
} Ifx_CAN_N_PCR;

/** \\brief  Node Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_N_SR_Bits B;
} Ifx_CAN_N_SR;

/** \\brief  Node Timer Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_N_TCCR_Bits B;
} Ifx_CAN_N_TCCR;

/** \\brief  Node Timer Receive Timeout Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_N_TRTR_Bits B;
} Ifx_CAN_N_TRTR;

/** \\brief  Node Timer Transmit Trigger Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_N_TTTR_Bits B;
} Ifx_CAN_N_TTTR;

/** \\brief  OCDS Control and Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_OCS_Bits B;
} Ifx_CAN_OCS;

/** \\brief  Panel Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_PANCTR_Bits B;
} Ifx_CAN_PANCTR;

/** \\brief  Reference Mark Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_REFMR_Bits B;
} Ifx_CAN_REFMR;

/** \\brief  Scheduler Instruction Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_SISR_Bits B;
} Ifx_CAN_SISR;

/** \\brief  Scheduler Start Pointer Node 0 Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_STPTR0_Bits B;
} Ifx_CAN_STPTR0;

/** \\brief  Scheduler Timing Status Register High */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_STSRH_Bits B;
} Ifx_CAN_STSRH;

/** \\brief  Scheduler Timing Status Register Low */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_STSRL_Bits B;
} Ifx_CAN_STSRL;

/** \\brief  Synchronization Mark Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_SYNMR_Bits B;
} Ifx_CAN_SYNMR;

/** \\brief  Time Trigger Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_TTCFGR_Bits B;
} Ifx_CAN_TTCFGR;

/** \\brief  Time Trigger Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_TTCR_Bits B;
} Ifx_CAN_TTCR;

/** \\brief  Time Trigger Flag Modification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_TTFMR_Bits B;
} Ifx_CAN_TTFMR;

/** \\brief  Time Trigger Interrupt Enable Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_TTIER_Bits B;
} Ifx_CAN_TTIER;

/** \\brief  Time Trigger Interrupt Node Pointer Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_TTINPR_Bits B;
} Ifx_CAN_TTINPR;

/** \\brief  Time Trigger Interrupt Request Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_TTIRR_Bits B;
} Ifx_CAN_TTIRR;

/** \\brief  Time Trigger Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_TTSR_Bits B;
} Ifx_CAN_TTSR;

/** \\brief  Time Unit Ratio Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_CAN_TURR_Bits B;
} Ifx_CAN_TURR;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Can_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \\brief  Message object */
typedef volatile struct _Ifx_CAN_MO
{
    Ifx_CAN_MO_FCR FCR;                     /**< \brief 0, Message Object  Function Control Register */
    Ifx_CAN_MO_FGPR FGPR;                   /**< \brief 4, Message Object  FIFO/Gateway Pointer Register */
    Ifx_CAN_MO_IPR IPR;                     /**< \brief 8, Message Object  Interrupt Pointer Register */
    Ifx_CAN_MO_AMR AMR;                     /**< \brief C, Message Object  Acceptance Mask Register */
    Ifx_CAN_MO_DATAL DATAL;                 /**< \brief 10, Message Object  Data Register Low */
    Ifx_CAN_MO_DATAH DATAH;                 /**< \brief 14, Message Object  Data Register High */
    Ifx_CAN_MO_AR AR;                       /**< \brief 18, Message Object  Arbitration Register */
    union
    {
        Ifx_CAN_MO_CTR CTR;/**< \brief 1C, Message Object  Control Register */
        Ifx_CAN_MO_STAT STAT;/**< \brief 1C, Message Object  Control Register */
    };

} Ifx_CAN_MO;

/** \\brief  Node object */
typedef volatile struct _Ifx_CAN_N
{
    Ifx_CAN_N_CR CR;                        /**< \brief 0, Node Control Register */
    Ifx_CAN_N_SR SR;                        /**< \brief 4, Node Status Register */
    Ifx_CAN_N_IPR IPR;                      /**< \brief 8, Node Interrupt Pointer Register */
    Ifx_CAN_N_PCR PCR;                      /**< \brief C, Node Port Control Register */
    Ifx_CAN_N_BTR BTR;                      /**< \brief 10, Node Bit Timing Register */
    Ifx_CAN_N_ECNT ECNT;                    /**< \brief 14, Node Error Counter Register */
    Ifx_CAN_N_FCR FCR;                      /**< \brief 18, Node Frame Counter Register */
    Ifx_CAN_N_TCCR TCCR;                    /**< \brief 1C, Node Timer Clock Control Register */
    Ifx_CAN_N_TRTR TRTR;                    /**< \brief 20, Node Timer Receive Timeout Register */
    Ifx_CAN_N_TTTR TATTR;                   /**< \brief 24, Node Timer A Transmit Trigger Register */
    Ifx_CAN_N_TTTR TBTTR;                   /**< \brief 28, Node Timer B Transmit Trigger Register */
    Ifx_CAN_N_TTTR TCTTR;                   /**< \brief 2C, Node Timer C Transmit Trigger Register */
} Ifx_CAN_N;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Can_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  CAN object */
typedef volatile struct _Ifx_CAN
{
    Ifx_CAN_CLC CLC;                        /**< \brief 0, CAN Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_CAN_ID ID;                          /**< \brief 8, Module Identification Register */
    Ifx_CAN_FDR FDR;                        /**< \brief C, CAN Fractional Divider Register */
    unsigned char reserved_10[216];         /**< \brief 10, \internal Reserved */
    Ifx_CAN_OCS OCS;                        /**< \brief E8, OCDS Control and Status */
    Ifx_CAN_KRSTCLR KRSTCLR;                /**< \brief EC, Kernel Reset Status Clear Register */
    Ifx_CAN_KRST1 KRST1;                    /**< \brief F0, Kernel Reset Register 1 */
    Ifx_CAN_KRST0 KRST0;                    /**< \brief F4, Kernel Reset Register 0 */
    Ifx_CAN_ACCEN1 ACCEN1;                  /**< \brief F8, Access Enable Register 1 */
    Ifx_CAN_ACCEN0 ACCEN0;                  /**< \brief FC, Access Enable Register 0 */
    Ifx_CAN_LIST LIST[16];                  /**< \brief 100, List Register */
    Ifx_CAN_MSPND MSPND[8];                 /**< \brief 140, Message Pending Register */
    unsigned char reserved_160[32];         /**< \brief 160, \internal Reserved */
    Ifx_CAN_MSID MSID[8];                   /**< \brief 180, Message Index Register */
    unsigned char reserved_1A0[32];         /**< \brief 1A0, \internal Reserved */
    Ifx_CAN_MSIMASK MSIMASK;                /**< \brief 1C0, Message Index Mask Register */
    Ifx_CAN_PANCTR PANCTR;                  /**< \brief 1C4, Panel Control Register */
    Ifx_CAN_MCR MCR;                        /**< \brief 1C8, Module Control Register */
    Ifx_CAN_MITR MITR;                      /**< \brief 1CC, Module Interrupt Trigger Register */
    unsigned char reserved_1D0[48];         /**< \brief 1D0, \internal Reserved */
    Ifx_CAN_N N0;                           /**< \brief 200, Node object */
    unsigned char reserved_230[80];         /**< \brief 230, \internal Reserved */
    Ifx_CAN_LTR LTR;                        /**< \brief 280, Local Time Register */
    Ifx_CAN_SYNMR SYNMR;                    /**< \brief 284, Synchronization Mark Register */
    Ifx_CAN_REFMR REFMR;                    /**< \brief 288, Reference Mark Register */
    Ifx_CAN_LREFMR LREFMR;                  /**< \brief 28C, Last Reference Mark Register */
    Ifx_CAN_TURR TURR;                      /**< \brief 290, Time Unit Ratio Register */
    Ifx_CAN_CYCTMR CYCTMR;                  /**< \brief 294, Cycle Time Register */
    Ifx_CAN_LOR LOR;                        /**< \brief 298, Local Offset Register */
    Ifx_CAN_GMR GMR;                        /**< \brief 29C, Global Mark Register */
    Ifx_CAN_LGMR LGMR;                      /**< \brief 2A0, Last Global Mark Register */
    Ifx_CAN_AWDR AWDR;                      /**< \brief 2A4, Application Watchdog Register */
    Ifx_CAN_LTCR LTCR;                      /**< \brief 2A8, Local Time Capture Register */
    unsigned char reserved_2AC[20];         /**< \brief 2AC, \internal Reserved */
    Ifx_CAN_TTCR TTCR;                      /**< \brief 2C0, Time Trigger Control Register */
    Ifx_CAN_TTCFGR TTCFGR;                  /**< \brief 2C4, Time Trigger Configuration Register */
    Ifx_CAN_TTSR TTSR;                      /**< \brief 2C8, Time Trigger Status Register */
    Ifx_CAN_TTFMR TTFMR;                    /**< \brief 2CC, Time Trigger Flag Modification Register */
    Ifx_CAN_TTIRR TTIRR;                    /**< \brief 2D0, Time Trigger Interrupt Request Register */
    Ifx_CAN_TTIER TTIER;                    /**< \brief 2D4, Time Trigger Interrupt Enable Register */
    Ifx_CAN_TTINPR TTINPR;                  /**< \brief 2D8, Time Trigger Interrupt Node Pointer Register */
    unsigned char reserved_2DC[20];         /**< \brief 2DC, \internal Reserved */
    Ifx_CAN_STSRL STSRL;                    /**< \brief 2F0, Scheduler Timing Status Register Low */
    Ifx_CAN_STSRH STSRH;                    /**< \brief 2F4, Scheduler Timing Status Register High */
    Ifx_CAN_SISR SISR;                      /**< \brief 2F8, Scheduler Instruction Status Register */
    unsigned char reserved_2FC[4];          /**< \brief 2FC, \internal Reserved */
    Ifx_CAN_N N1;                           /**< \brief 300, Node object */
    unsigned char reserved_330[208];        /**< \brief 330, \internal Reserved */
    Ifx_CAN_N N2;                           /**< \brief 400, Node object */
    unsigned char reserved_430[208];        /**< \brief 430, \internal Reserved */
    Ifx_CAN_N N3;                           /**< \brief 500, Node object */
    unsigned char reserved_530[208];        /**< \brief 530, \internal Reserved */
    Ifx_CAN_N N4;                           /**< \brief 600, Node object */
    unsigned char reserved_630[208];        /**< \brief 630, \internal Reserved */
    Ifx_CAN_N N5;                           /**< \brief 700, Node object */
    unsigned char reserved_730[208];        /**< \brief 730, \internal Reserved */
    Ifx_CAN_N N6;                           /**< \brief 800, Node object */
    unsigned char reserved_830[208];        /**< \brief 830, \internal Reserved */
    Ifx_CAN_N N7;                           /**< \brief 900, Node object */
    unsigned char reserved_930[1744];       /**< \brief 930, \internal Reserved */
    Ifx_CAN_MO MO[256];                     /**< \brief 1000, Message objects */
    unsigned char reserved_3000[4092];      /**< \brief 3000, \internal Reserved */
    Ifx_CAN_STPTR0 STPTR0;                  /**< \brief 3FFC, Scheduler Start Pointer Node 0 Register */
} Ifx_CAN;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#if defined (__TASKING__)
#pragma warning restore
#endif
/******************************************************************************/
#endif /* IFXCAN_REGDEF_H */
